# 1) SQL QUERY FOR BOOKING & REVENUE

In [3]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import datetime
import calendar
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
COUNT(order_id) Bookings, 	
		
SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),1,                                                                   
    0))))))) 'Allocated_count',
                          
SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
                         IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
                         IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
                         AND channel_type<>0 AND payed_amount>0),1,0)))) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),99,                                                                   
                          0))))))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id,X.channel_user
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new',d.channel_user
                     
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) 
                     BETWEEN
                     LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY
                     AND 
                     LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-08-01,Akanshi Singh,Ashish Chandra,Outbound Sales,crm,26,1,1.0,0.0,...,1605.0,1605.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
1,Agra,2019-08-01,Asfak,Sandeep Negi,Affiliate,crm,15,1,1.0,1.0,...,0.0,99.0,99.0,0.0,0.0,99.0,0.0,0.0,0.0,1
2,Agra,2019-08-01,Bhanu Yadav,Bhawna Anand,Outbound Sales,crm,15,2,2.0,2.0,...,7399.0,7399.0,7399.0,7399.0,7399.0,0.0,0.0,0.0,2.0,2
3,Agra,2019-08-01,Chetan Bhardwaj,Bhawna Anand,Outbound Sales,crm,15,1,1.0,1.0,...,2199.0,2199.0,2199.0,2199.0,2199.0,0.0,0.0,0.0,1.0,1
4,Agra,2019-08-01,Madhu yadav,Bhawna Anand,Outbound Sales,crm,15,1,1.0,1.0,...,200.0,200.0,200.0,0.0,200.0,0.0,0.0,0.0,0.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [4]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT x1.payed_amount,SUM(x2.lab_cost) sum_addon_cost,x1.sample_collection_time,x1.order_id,SUM(order_count) orders, 
x1.billing_cust_city,DATE(x1.sample_collection_time)
FROM

(SELECT dom1.order_id,
 IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
 IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
 IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))'payed_amount',

IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))'order_count', 

sample_collection_time,billing_cust_city
FROM deal_order_management dom1
WHERE DATE(dom1.sample_collection_time)  BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY
AND dom1.is_sample_collected=1
GROUP BY dom1.order_id)x1
LEFT JOIN
(SELECT SUM(od.addon_cost)AS lab_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND 
dom.delivery_status NOT IN (-1,0,3,13) AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time)  BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
GROUP BY dom.order_id) x2 ON x1.order_id = x2.order_id
GROUP BY x1.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

,payed_amount,sum_addon_cost,sample_collection_time,order_id,orders,billing_cust_city,DATE(x1.sample_collection_time)
0,0,45.0,2019-08-10 09:30:00,863777971,1.0,Ghaziabad,2019-08-10
1,0,1279.0,2019-08-07 07:00:00,897857469,1.0,Delhi,2019-08-07
2,0,287.0,2019-08-13 09:00:00,1642714713,1.0,Amritsar,2019-08-13
3,0,1324.0,2019-08-03 06:00:00,1662678637,1.0,Ghaziabad,2019-08-03
4,0,80.0,2019-08-07 06:00:00,1664694351,1.0,Mumbai,2019-08-07

# 3) SQL QUERY FOR LEADS DATA

In [5]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',

COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'ncr'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Greater Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Gurgaon'")
  result = self._query(query)

   CITY Leads_Tag  created_on  Leads
0  None  Facebook  2019-07-31     19
1  None  Facebook  2019-08-01     14
2  None  Facebook  2019-08-02     12
3  None  Facebook  2019-08-03     31
4  None  Facebook  2019-08-04     14

# 4) SQL QUERY FOR KIT COST

In [6]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ghaziabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Amritsar'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Jalandhar'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Gurgaon'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Mohali'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Indore'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Dehradun'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Kanpur'")
  result = self._query(query)

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-08-10         Ghaziabad              69.0    2311.5
1  2019-08-07             Delhi             341.0   11423.5
2  2019-08-13          Amritsar              20.0     670.0
3  2019-08-03         Ghaziabad              46.0    1541.0
4  2019-08-07            Mumbai              95.0    3182.5

# 5) SQL QUERY FOR FACEBOOK COST

In [7]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
GROUP BY city'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost

          city  Facebook_cost
0                  1811627.36
1         AGRA       19311.90
2     AMRITSAR       36094.73
3    Bengaluru      194857.91
4       BHOPAL       25688.91
5   CHANDIGARH       33948.27
6     DEHRADUN       32595.49
7      HARYANA       39732.97
8    HYDERABAD       87199.72
9       INDORE       26013.19
10      JAIPUR       34999.64
11   Jalandhar       35988.49
12      KANPUR       54945.77
13     Lucknow       54560.08
14    Ludhiana       51657.58
15      MEERUT       19579.87
16      MUMBAI      276524.98
17         NCR      565667.64
18        PUNE      148047.22

In [8]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT date(lcd.date_time) 'Lead_creation_date',SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE lcd.vendor_id =3 AND DATE(Date_time)  BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
GROUP BY city,Lead_creation_date'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost.head()

  Lead_creation_date  city  Facebook_cost
0         2019-07-31  AGRA         966.92
1         2019-08-01  AGRA        1017.73
2         2019-08-02  AGRA        1058.09
3         2019-08-03  AGRA        1438.08
4         2019-08-04  AGRA        1515.22

# 6) SQL QUERY FOR GOOGLE COST

In [9]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT date(lcd.date_time) 'Lead_creation_date',SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
GROUP BY city,Lead_creation_date'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

  Lead_creation_date city  Google_cost
0         2019-07-31           1532.51
1         2019-08-01           2184.97
2         2019-08-02           1481.21
3         2019-08-03           1923.66
4         2019-08-04            925.93

# 7) SQL QUERY FOR CITY & STATE

In [10]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) SQL QUERY FOR REFUND AMOUNT

In [11]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT city_name, Refund_month,SUM(refund) 'refund_amt'
FROM(
SELECT rp.booking_id,rp.created_at,rp.updated_at,rp.status,DATE(dom.sample_collection_time),SUM(rp.refund_amount) refund,
MONTHNAME(rp.transaction_date) Refund_month,rp.transaction_date,billing_cust_city city_name FROM refund_process rp 
LEFT JOIN deal_order_management dom ON dom.order_id = rp.booking_id
WHERE DATE(rp.transaction_date) 
BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
AND rp.payment_status =1
GROUP BY rp.booking_id)x1
GROUP BY city_name,Refund_month'''
df_refund = pd.read_sql_query(query,engine)
engine.dispose()
df_refund.head()

    city_name Refund_month  refund_amt
0        Agra       August      1220.0
1      Ambala       August      1500.0
2   Bengaluru       August      6445.0
3  Chandigarh       August      1250.0
4       Delhi       August     12951.0

# 9) SQL QUERY FOR PHLEBO CONVEYANCE

In [12]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT scz.zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled), 
SUM(ROUND(actual_distance_traveled*2.5,0)) AS conveyance
FROM `phlebo_travel_report` AS ptr
LEFT JOIN sample_collector AS sc ON ptr.sample_collector_id = sc.sid
LEFT JOIN sample_collection_zone AS scz ON scz.zone_id = ptr.zone_id
WHERE travel_date BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
GROUP BY scz.zone_name'''
df_conveyance = pd.read_sql_query(query,engine)
engine.dispose()
df_conveyance.head()

,zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled),conveyance
0,Agra,1679.776,2486.451,6216.0
1,Ambala,941.952,1207.374,3018.0
2,Amritsar,1911.558,3592.122,8979.0
3,Bahadurgarh,381.810,590.183,1476.0
4,Bengaluru Zone 1-Kalyan Nagar,3853.661,6182.135,15459.0

# 10) No. of days MTD & overall

In [13]:
now = datetime.datetime.now()
mtd_days=now.day
overall_days=calendar.monthrange(now.year, now.month-1)[1]

# 11) Booking & Revenue DETAILED

In [14]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,BLR,1176,1305558.0,923.0,1168310.0,184.0,182.0,740.0,1052092.0,113193.0
1,Dehradun,272,299572.0,225.0,269602.0,30.0,37.0,192.0,263887.0,49702.0
2,HR,322,382926.0,275.0,349418.0,46.0,45.0,198.0,342359.0,121836.0
3,Hyderabad,600,724683.0,463.0,597029.0,160.0,106.0,305.0,417235.0,16564.0
4,Jaipur,222,276141.0,197.0,255099.0,22.0,27.0,166.0,274565.0,84844.0
5,MP,352,374124.0,221.0,301514.0,56.0,74.0,161.0,241451.0,31278.0
6,Mumbai,1595,2043014.0,1234.0,1727969.0,302.0,348.0,869.0,1427806.0,227962.0
7,NCR,7397,8369233.0,6496.0,7818059.0,821.0,841.0,5466.0,7989937.0,1669049.0
8,PCM,436,573971.0,369.0,506435.0,60.0,65.0,292.0,459277.0,70096.0
9,Pune,826,1059347.0,639.0,907178.0,214.0,185.0,394.0,661524.0,113088.0
10,Punjab,777,931583.0,643.0,810904.0,132.0,106.0,505.0,959951.0,335679.0
11,UP,1242,1446544.0,1057.0,1284436.0,160.0,156.0,885.0,1322773.0,317710.0
0,Total,15217,17786696.0,12742.0,15995953.0,2187.0,2172.0,10173.0,15412857.0,3151001.0

# 22) GROSS MARGIN DETAILED

In [15]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['orders'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=379178/overall_days*mtd_days
r=162293/overall_days*mtd_days

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

q_MP=np.sum(dfm4.iloc[5:6,-1:])
q_MP

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

cost_prop_MP = np.sum(r)
cost_prop_MP

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 
                                     cost_prop_MP if x=='MP' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'orders', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['orders'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['orders'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

        State  Gross_Margin  Gross_Margin/order  Gross_Margin%     ASP
0         BLR      709454.0               959.0           0.67  1422.0
1    Dehradun      162929.0               849.0           0.62  1374.0
2          HR      193797.0               979.0           0.57  1729.0
3   Hyderabad      276152.0               905.0           0.66  1368.0
4      Jaipur      163868.0               987.0           0.60  1654.0
5          MP      120025.0               745.0           0.50  1500.0
6      Mumbai      919284.0              1058.0           0.64  1643.0
7         NCR     4971188.0               909.0           0.62  1462.0
8         PCM      280876.0               962.0           0.61  1573.0
9        Pune      440493.0              1118.0           0.67  1679.0
10     Punjab      526156.0              1042.0           0.55  1901.0
11         UP      836878.0               946.0           0.63  1495.0
0       Total     9601100.0               944.0           0.62  1515.0

# 33) LEADS DATA DETAILED

In [16]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0         BLR      1219     858
1    Dehradun       361      66
2          HR       331      82
3   Hyderabad       843     514
4      Jaipur       301     111
5          MP       846     103
6      Mumbai      3645     769
7         NCR      4542    2247
8         PCM       311     196
9        Pune      1163     394
10     Punjab      1273     169
11         UP      1512     367
0       Total     16347    5876

# 44) KIT COST DETAILED

In [17]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

        State  kit_cost
0         BLR   30552.0
1    Dehradun   10016.5
2          HR   10988.0
3   Hyderabad   12261.0
4      Jaipur    8107.0
5          MP    8207.5
6      Mumbai   41774.5
7         NCR  256509.5
8         PCM   15611.0
9        Pune   18458.5
10     Punjab   29446.5
11         UP   41272.0
0       Total  483204.0

# 55) FACEBOOK COST DETAILED

In [18]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'inner')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0         BLR      194857.91
1    Dehradun       32595.49
2          HR       39732.97
3   Hyderabad       87199.72
4      Jaipur       34999.64
5          MP       51702.10
6      Mumbai      276524.98
7         NCR      565667.64
8         PCM       33948.27
9        Pune      148047.22
10     Punjab       69751.31
11         UP      148397.62
0       Total     1683424.87

# 66) GOOGLE COST DETAILED

In [19]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0         BLR    272918.93
1    Dehradun     13961.73
2          HR     12104.92
3   Hyderabad    186379.84
4      Jaipur     28790.96
5          MP     23473.78
6      Mumbai    310716.26
7         NCR    631960.94
8         PCM     54126.75
9        Pune    140408.44
10     Punjab     50786.18
11         UP     85998.63
0       Total   1811627.36

# 88) REFUND DETAILED

In [20]:
dfr2 = df_city.merge(df_refund,left_on ='Lead_City',right_on = 'city_name', how = 'left')

dfr2['refund_amt'].replace(np.NaN,0)
dfr3=dfr2.drop(columns = 'Lead_City')
dfr4=pd.DataFrame(dfr3.groupby(['State'])['refund_amt'].sum())
dfr4.reset_index(inplace=True)


dfr5 = dfr4[['refund_amt']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfr5 = dfr5._get_numeric_data().apply(lambda x : var_sum(x))

df_refund_Final=pd.concat([dfr4,dfr5],sort=False)
df_refund_Final['State'].fillna('Total',inplace = True)
df_refund_Final

        State  refund_amt
0   Ahmedabad         0.0
1         BLR      6445.0
2    Dehradun         0.0
3          HR      6346.0
4   Hyderabad      5017.0
5      Jaipur         0.0
6          MP         0.0
7      Mumbai     16635.0
8         NCR     29163.0
9         PCM      3344.0
10       Pune      2883.0
11     Punjab         0.0
12         UP      7619.0
0       Total     77452.0

# 99) PHLEBO CONVEYANCE DETAILED

In [21]:
dfc2 = df_city.merge(df_conveyance,left_on ='Lead_City',right_on = 'zone_name', how = 'left')

dfc2['conveyance'].replace(np.NaN,0)
dfc3=dfc2.drop(columns = 'Lead_City')
dfc4=pd.DataFrame(dfc3.groupby(['State'])['conveyance'].sum())
dfc4.reset_index(inplace=True)


dfc5 = dfc4[['conveyance']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc5 = dfc5._get_numeric_data().apply(lambda x : var_sum(x))

df_conveyance_Final=pd.concat([dfc4,dfc5],sort=False)
df_conveyance_Final['State'].fillna('Total',inplace = True)
df_conveyance_Final

        State  conveyance
0   Ahmedabad         0.0
1         BLR     43691.0
2    Dehradun      8884.0
3          HR     12968.0
4   Hyderabad     23527.0
5      Jaipur      9542.0
6          MP     12849.0
7      Mumbai     55753.0
8         NCR    214663.0
9         PCM     17614.0
10       Pune     24649.0
11     Punjab     33881.0
12         UP     48036.0
0       Total    506057.0

# FINAL MERGING OF ALL DF

In [22]:
df_LMTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='left')

In [23]:
df_LMTD_FINAL2=pd.merge(df_LMTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='left')

In [24]:
df_LMTD_FINAL3=pd.merge(df_LMTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='left')

In [25]:
df_LMTD_FINAL4=pd.merge(df_LMTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='left')

In [26]:
df_LMTD_FINAL5=pd.merge(df_LMTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='left')

In [27]:
df_LMTD_FINAL6=pd.merge(df_LMTD_FINAL5,df_refund_Final,left_on='State',right_on='State',how='left')

In [28]:
df_LMTD_FINAL7=pd.merge(df_LMTD_FINAL6,df_conveyance_Final,left_on='State',right_on='State',how='left')
df_LMTD_FINAL7

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon,...,Gross_Margin/order,Gross_Margin%,ASP,Facebook,Google,kit_cost,Facebook_cost,Google_cost,refund_amt,conveyance
0,BLR,1176,1305558.0,923.0,1168310.0,184.0,182.0,740.0,1052092.0,113193.0,...,959.0,0.67,1422.0,1219,858,30552.0,194857.91,272918.93,6445.0,43691.0
1,Dehradun,272,299572.0,225.0,269602.0,30.0,37.0,192.0,263887.0,49702.0,...,849.0,0.62,1374.0,361,66,10016.5,32595.49,13961.73,0.0,8884.0
2,HR,322,382926.0,275.0,349418.0,46.0,45.0,198.0,342359.0,121836.0,...,979.0,0.57,1729.0,331,82,10988.0,39732.97,12104.92,6346.0,12968.0
3,Hyderabad,600,724683.0,463.0,597029.0,160.0,106.0,305.0,417235.0,16564.0,...,905.0,0.66,1368.0,843,514,12261.0,87199.72,186379.84,5017.0,23527.0
4,Jaipur,222,276141.0,197.0,255099.0,22.0,27.0,166.0,274565.0,84844.0,...,987.0,0.60,1654.0,301,111,8107.0,34999.64,28790.96,0.0,9542.0
5,MP,352,374124.0,221.0,301514.0,56.0,74.0,161.0,241451.0,31278.0,...,745.0,0.50,1500.0,846,103,8207.5,51702.10,23473.78,0.0,12849.0
6,Mumbai,1595,2043014.0,1234.0,1727969.0,302.0,348.0,869.0,1427806.0,227962.0,...,1058.0,0.64,1643.0,3645,769,41774.5,276524.98,310716.26,16635.0,55753.0
7,NCR,7397,8369233.0,6496.0,7818059.0,821.0,841.0,5466.0,7989937.0,1669049.0,...,909.0,0.62,1462.0,4542,2247,256509.5,565667.64,631960.94,29163.0,214663.0
8,PCM,436,573971.0,369.0,506435.0,60.0,65.0,292.0,459277.0,70096.0,...,962.0,0.61,1573.0,311,196,15611.0,33948.27,54126.75,3344.0,17614.0
9,Pune,826,1059347.0,639.0,907178.0,214.0,185.0,394.0,661524.0,113088.0,...,1118.0,0.67,1679.0,1163,394,18458.5,148047.22,140408.44,2883.0,24649.0
10,Punjab,777,931583.0,643.0,810904.0,132.0,106.0,505.0,959951.0,335679.0,...,1042.0,0.55,1901.0,1273,169,29446.5,69751.31,50786.18,0.0,33881.0
11,UP,1242,1446544.0,1057.0,1284436.0,160.0,156.0,885.0,1322773.0,317710.0,...,946.0,0.63,1495.0,1512,367,41272.0,148397.62,85998.63,7619.0,48036.0
12,Total,15217,17786696.0,12742.0,15995953.0,2187.0,2172.0,10173.0,15412857.0,3151001.0,...,944.0,0.62,1515.0,16347,5876,483204.0,1683424.87,1811627.36,77452.0,506057.0

# Date & city wise Google leads

In [29]:
dfl3_google = dfl3[dfl3['Leads_Tag'] == 'Google'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_google.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_g_sum = dfl3_google._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_google=pd.concat([dfl3_google,dfl3_g_sum],axis=0,sort=False)

dfl3_google.reset_index(inplace=True)
dfl3_google.rename(columns = {'index' : 'State'},inplace=True)
dfl3_google.fillna(0, inplace = True)
dfl3_google.loc[dfl3_google.shape[0]-1,'State'] = 'Total'
dfl3_google

created_on,State,2019-07-31,2019-08-01,2019-08-02,2019-08-03,2019-08-04,2019-08-05,2019-08-06,2019-08-07,2019-08-08,2019-08-09,2019-08-10,2019-08-11,2019-08-12
0,BLR,64,67,63,53,59,60,82,75,50,65,89,62,69
1,Dehradun,2,3,4,7,5,7,8,5,8,4,4,4,5
2,HR,3,8,5,4,4,5,6,3,9,6,14,11,4
3,Hyderabad,31,37,32,39,33,46,33,36,44,53,50,33,47
4,Jaipur,5,10,10,6,5,8,9,11,11,7,10,9,10
5,MP,10,7,5,9,6,3,7,11,9,13,11,3,9
6,Mumbai,74,69,73,55,53,64,65,49,47,59,70,44,47
7,NCR,178,167,142,173,151,172,173,200,155,194,202,161,179
8,PCM,19,14,12,10,14,21,13,12,8,14,21,19,19
9,Pune,24,37,31,27,25,25,40,34,39,19,46,21,26
10,Punjab,18,13,12,12,8,15,17,14,9,11,17,8,15
11,UP,26,27,31,31,28,15,23,23,33,30,32,33,35
12,Total,454,459,420,426,391,441,476,473,422,475,566,408,465

# Date & city wise Facebook leads

In [30]:
dfl3_fb = dfl3[dfl3['Leads_Tag'] == 'Facebook'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_fb.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_fb_sum = dfl3_fb._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_fb = pd.concat([dfl3_fb,dfl3_fb_sum],axis=0,sort=False)

dfl3_fb.reset_index(inplace=True)
dfl3_fb.rename(columns = {'index' : 'State'},inplace=True)
dfl3_fb.fillna(0, inplace = True)
dfl3_fb.loc[dfl3_fb.shape[0]-1,'State'] = 'Total'
dfl3_fb

created_on,State,2019-07-31,2019-08-01,2019-08-02,2019-08-03,2019-08-04,2019-08-05,2019-08-06,2019-08-07,2019-08-08,2019-08-09,2019-08-10,2019-08-11,2019-08-12
0,BLR,104,113,99,92,84,84,90,84,69,81,70,135,114
1,Dehradun,22,28,20,25,26,24,45,32,19,25,23,33,39
2,HR,28,22,27,20,22,24,27,24,17,27,29,36,28
3,Hyderabad,83,74,56,76,47,51,66,69,62,64,55,67,73
4,Jaipur,20,14,14,19,29,32,20,27,23,21,20,30,32
5,MP,57,70,57,72,55,65,68,64,53,56,47,93,89
6,Mumbai,146,201,250,320,301,338,318,305,270,234,246,321,395
7,NCR,283,298,296,318,293,356,359,402,409,356,320,432,420
8,PCM,21,34,22,22,15,22,20,16,23,27,36,23,30
9,Pune,93,120,81,93,73,71,82,84,63,73,54,132,144
10,Punjab,82,115,99,116,109,98,96,86,88,73,88,133,90
11,UP,111,120,87,104,90,127,108,124,99,105,107,167,163
12,Total,1050,1209,1108,1277,1144,1292,1299,1317,1195,1142,1095,1602,1617

# Date & city wise Facebook cost

In [31]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dffb1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dffb1=dffb1.drop(columns = 'Lead_City')
dffb1['State'].dropna(inplace=True)

df_fc = dffb1.pivot_table(index=['State'],columns=['Lead_creation_date'],values='Facebook_cost',aggfunc=np.sum)
df_fc.reset_index()


def var_sum(x):
    return pd.Series(np.sum(x))


df_fbc_sum = df_fc._get_numeric_data().apply(lambda x : var_sum(x))

df_fc=pd.concat([df_fc,df_fbc_sum],axis=0,sort=False)
df_fc.reset_index(inplace=True)
df_fc.rename(columns = {'index' : 'State'},inplace=True)
df_fc.fillna(0, inplace = True)
df_fc.loc[df_fc.shape[0]-1,'State'] = 'Total'
df_fc

Lead_creation_date,State,2019-07-31,2019-08-01,2019-08-02,2019-08-03,2019-08-04,2019-08-05,2019-08-06,2019-08-07,2019-08-08,2019-08-09,2019-08-10,2019-08-11,2019-08-12
0,BLR,13854.05,14109.21,13014.39,14353.91,14684.38,14943.81,14709.49,15267.01,14925.26,15704.53,13322.57,18013.03,17956.27
1,Dehradun,2014.81,2002.85,1946.35,1948.01,2521.50,2705.26,3057.40,2491.14,2530.09,2455.36,2854.59,3039.26,3028.87
2,HR,2510.96,2497.22,2449.58,2366.70,2889.11,2989.47,3033.38,2937.06,3031.26,3150.07,3802.23,4038.94,4036.99
3,Hyderabad,5980.08,6023.89,5702.47,6733.41,6875.40,7054.29,6868.57,7081.37,6901.87,7072.57,7020.72,6908.25,6976.83
4,Jaipur,1847.98,1999.08,1935.08,2199.12,2950.93,3036.02,2941.65,3044.32,3039.35,3006.13,2954.54,3023.17,3022.27
5,MP,4015.90,4027.69,3940.20,4013.82,3994.90,4043.01,3930.96,4044.73,3843.60,3851.93,3956.11,3995.69,4043.56
6,Mumbai,10633.28,11684.25,15279.93,19727.50,22452.76,23306.49,22723.20,22782.71,22348.33,21970.15,25100.56,27566.66,30949.16
7,NCR,29308.02,29214.58,33862.12,39414.63,44857.70,46101.48,47318.63,49013.86,49478.84,45849.53,47522.72,52051.68,51673.85
8,PCM,2511.09,2499.93,2460.87,2477.95,2416.07,2539.56,2453.68,2545.19,2545.68,2796.84,3142.59,2557.89,3000.93
9,Pune,10667.60,11111.62,11717.46,9966.69,9783.80,10116.84,9962.55,9812.80,11256.57,12444.33,11117.83,14946.79,15142.34
10,Punjab,5933.25,6020.44,6064.26,6926.48,7012.15,3744.73,4006.50,4033.38,3997.92,3878.56,4042.37,7054.85,7036.42
11,UP,9967.92,9995.24,9890.20,10677.45,10900.33,11129.43,10773.37,11131.36,10986.98,11511.65,13311.65,14125.03,13997.01
12,Total,99244.94,101186.00,108262.91,120805.67,131339.03,131710.39,131779.38,134184.93,134885.75,133691.65,138148.48,157321.24,160864.50

# Date & city wise Google cost

In [32]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

df_gc = dfc1.pivot_table(index=['State'],columns=['Lead_creation_date'],values='Google_cost',aggfunc=np.sum)
df_gc.reset_index()


def var_sum(x):
    return pd.Series(np.sum(x))


df_gc_sum = df_gc._get_numeric_data().apply(lambda x : var_sum(x))

df_gc=pd.concat([df_gc,df_gc_sum],axis=0,sort=False)
df_gc.reset_index(inplace=True)
df_gc.rename(columns = {'index' : 'State'},inplace=True)
df_gc.fillna(0, inplace = True)
df_gc.loc[df_gc.shape[0]-1,'State'] = 'Total'
df_gc

Lead_creation_date,State,2019-07-31,2019-08-01,2019-08-02,2019-08-03,2019-08-04,2019-08-05,2019-08-06,2019-08-07,2019-08-08,2019-08-09,2019-08-10,2019-08-11,2019-08-12
0,BLR,19968.31,17319.97,16327.69,18337.49,16895.65,23906.72,23787.08,23057.20,21036.70,19609.83,26426.24,20630.74,25615.31
1,Dehradun,948.90,833.97,796.69,1113.70,1080.28,1817.41,1219.23,1462.00,542.02,1154.69,765.62,844.34,1382.88
2,HR,739.01,1098.89,578.19,859.73,822.12,532.27,614.95,464.24,931.94,1139.99,1533.60,1551.46,1238.53
3,Hyderabad,11724.20,12621.07,12548.45,13762.61,11299.08,16156.14,13008.33,16420.56,15780.52,15567.32,17011.82,12266.41,18213.33
4,Jaipur,1882.21,2702.87,1862.77,2063.22,1547.22,1894.13,2273.72,2397.46,2411.77,2105.94,2057.79,2356.11,3235.75
5,MP,1733.11,1473.31,1882.21,1563.24,1316.26,1417.99,2198.86,1943.30,2290.35,2248.01,1976.46,1994.07,1436.61
6,Mumbai,23353.55,23039.92,22283.05,20083.20,16766.27,21464.32,28704.18,28587.02,28363.01,31474.00,30225.72,18232.74,18139.28
7,NCR,47570.56,48786.91,44892.85,49268.53,43061.05,55256.21,51056.13,52847.04,49086.09,46689.57,52955.21,44974.91,45515.88
8,PCM,4320.49,3163.86,2927.42,3048.04,2813.96,4814.12,4334.74,3543.83,4819.61,4569.55,6409.35,4423.02,4938.76
9,Pune,10601.94,11635.33,9216.77,12879.03,8370.29,9586.66,11395.42,11801.51,11867.02,10198.19,12636.98,10653.28,9566.02
10,Punjab,4249.33,2822.69,3674.89,3704.52,2786.18,4110.21,5156.70,4004.42,4032.88,3106.01,5568.15,3691.37,3878.83
11,UP,6437.92,5724.01,7895.79,7844.52,6997.59,5072.18,5100.46,6602.95,6203.11,6952.69,8169.53,7140.97,5856.91
12,Total,133529.53,131222.80,124886.77,134527.83,113755.95,146028.36,148849.80,153131.53,147365.02,144815.79,165736.47,128759.42,139018.09

In [33]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_LMTD_FINAL7.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=0)
dfl3_fb.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=17)
dfl3_google.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=35)
df_fc.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=53)
df_gc.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=71)
writer.save()